
-- Заполнение таблицы Customers
INSERT INTO Customers (customer_id, customer_name, email, phone, city)
VALUES
(1, 'Анна', 'anna@example.com', '123-456-7890', 'Москва'),
(2, 'Борис', 'boris@example.com', '987-654-3210', 'Санкт-Петербург'),
(3, 'Виктория', 'viktoria@example.com', '555-555-5555', 'Казань');

-- Заполнение таблицы Products
INSERT INTO Products (product_id, product_name, category, price)
VALUES
(1, 'Ноутбук', 'Электроника', 75000.00),
(2, 'Наушники', 'Электроника', 5000.00),
(3, 'Кофеварка', 'Бытовая техника', 3000.00),
(4, 'Микроволновка', 'Бытовая техника', 7000.00);


-- Заполнение таблицы Orders
INSERT INTO Orders (order_id, customer_id, product_id, order_date, quantity)
VALUES
(1, 1, 1, '2023-10-10', 1),  -- Анна заказала 1 ноутбук
(2, 1, 2, '2023-10-11', 2),  -- Анна заказала 2 наушников
(3, 2, 3, '2023-10-12', 1),  -- Борис заказал 1 кофеварку
(4, 3, 4, '2023-10-13', 1),  -- Виктория заказала 1 микроволновку
(5, 3, 1, '2023-10-14', 1);  -- Виктория заказала 1 ноутбук
